<h1 align="center">Data Analysis using Pandas and Numpy </h1>

In [1]:
import pandas as pd
import numpy as np

## categorical()

#### Qn. Replace PClass values with categorical labels

In [2]:
titanic_train = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",
                           sep='\t') 
titanic_train.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [9]:
#create categorial object
Pcat = pd.Categorical(titanic_train['Pclass'])
print(type(Pcat))
print(Pcat)

#rename values of categorical object
catCol = Pcat.rename_categories(['Class A', 'Class B', 'Class C'])
print(catCol)

#replace df col with new col
titanic_train['Pclass'] = catCol
titanic_train.head(3)

<class 'pandas.core.arrays.categorical.Categorical'>
[3, 1, 3, 1, 3, ..., 1, 3, 3, 3, 1]
Length: 156
Categories (3, int64): [1, 2, 3]
[Class C, Class A, Class C, Class A, Class C, ..., Class A, Class C, Class C, Class C, Class A]
Length: 156
Categories (3, object): [Class A, Class B, Class C]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,Class C,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,Class A,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,Class C,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

#### Qn. Extract only the char value from the Cabin column

In [22]:
#check the 'Cabin col values'
print(titanic_train['Cabin'].unique())

print(titanic_train.dtypes)

#convert col to str
converted = titanic_train['Cabin'].astype(str)
type(converted[1])
converted.head(3)

#create new col with extracted values
newCol = [val[0] for val in converted]

titanic_train['CabinNew'] = newCol
titanic_train.head(3)

[nan 'C85' 'C123' 'E46' 'G6' 'C103' 'D56' 'A6' 'C23 C25 C27' 'B78' 'D33'
 'B30' 'C52' 'B28' 'C83' 'F33' 'F G73' 'E31' 'A5' 'D10 D12' 'D26' 'C110'
 'B58 B60' 'E101' 'F E69' 'D47' 'B86' 'F2' 'C2']
PassengerId       int64
Survived          int64
Pclass         category
Name             object
Sex              object
Age             float64
SibSp             int64
Parch             int64
Ticket           object
Fare            float64
Cabin            object
Embarked         object
dtype: object

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,CabinNew
0,1,0,Class C,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,n
1,2,1,Class A,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,C
2,3,1,Class C,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,n